# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Replace macOS utilities with GNU utilies
brew 'findutils'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar' 
brew 'gnu-which' 
brew 'gnutls'
brew 'gawk'
brew 'grep'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'

# Programming
brew 'git'
brew 'python'
brew 'r'

# CLI utilities
brew 'zsh'
brew 'getantibody/tap/antibody'
brew 'bash'
brew 'neofetch'
brew 'prettyping'
brew 'diff-so-fancy'
brew 'bat'
brew 'fzf'
brew 'tmux'
brew 'tree'
brew 'tldr'
brew 'htop'
brew 'wget'
brew 'asciinema'
brew 'mas'
brew 'imagemagick'
brew 'ntfs-3g'
brew 'pandoc'

# Cask
cask 'osxfuse'
cask 'amethyst'
cask 'cyberduck'
cask 'iterm2'
cask 'discord'
cask 'rstudio'
cask 'the-unarchiver'
cask 'vlc'
cask 'whatsapp'
cask 'zotero'
cask 'tunnelblick'
cask 'tor-browser'
